---
kind: property
id: P:Autodesk.Revit.DB.BeamSystem.BeamSystemType
source: html/f738ec01-4d36-884c-cc40-3a78c8b1b2bd.htm
---
# Autodesk.Revit.DB.BeamSystem.BeamSystemType Property

Retrieves or changes the type of the BeamSystem.

## Syntax (C#)
```csharp
public BeamSystemType BeamSystemType { get; set; }
```